<template>
  <div>
    <p>
      Седьмые традиционные соревнования по большому теннису на кубок мэра
      Южно-Сахалинска пройдут с 15 августа по 13 сентября на теннисных кортах
      городского парка культуры и отдыха им. Гагарина и теннисного клуба
      “Хоккайдо”.<br />
      Можно заполнить анкету онлайн, либо записаться по телефону 607-999.
      <el-link
        @click="moreInfo = true"
        type="primary"
        style="font-weight: normal; vertical-align: inherit;"
        :class="{ introLink: $device.isDesktop }"
      >
        Подробнее о турнире...
      </el-link>
    </p>

    <el-dialog
      title="Информация о турнире"
      :visible.sync="moreInfo"
      :fullscreen="$device.isMobile ? true : false"
    >
      <p class="info">
        Седьмые традиционные соревнования по большому теннису на кубок мэра
        Южно-Сахалинска пройдут с 15 августа по 13 сентября на теннисных кортах
        городского парка культуры и отдыха имени Гагарина и теннисного клуба
        “Хоккайдо”. Организаторами турнира выступили Федерация тенниса Сахалина
        и Курил, департамент по делам молодежи, спорту и туризму администрации
        Южно-Сахалинска при поддержке администрации парка и теннисного клуба
        "Хоккайдо".
      </p>
      <div>
        <video
          controls
          preload="none"
          poster="poster_tv.png"
          src="~assets/kubok_tv.mp4"
        >
          <p>Your browser does not support the video tag.</p>
        </video>
      </div>
      <p class="info">
        Соревнования будут проходить в два этапа:
      </p>
      <p class="info">
        Первый этап соревнований пройдет с 15 августа по 30 августа. В этот
        период на корты выйдут самые младшие дети от 6 до 10 лет (программа
        мини-тенниса – красная, оранжевая, зеленая лига), а также юниоры и
        девушки от 10 до 17 лет (одиночный, смешанный разряд).
      </p>
      <p class="info">
        Второй этап соревнований состоится с 1 сентября по 13 сентября. В этот
        период на корты выйдут взрослые игроки - любители тенниса от 18 лет и
        старше (одиночный, парный, смешанный разряд). Также предусмотрены
        отдельная категория для возрастных игроков (от 50 лет и старше), и
        категория для игроков “продвинутого” уровня игры.
      </p>
      <p class="info">
        Для участия в турнире необходимо подать заявку на сайте sakhopen.ru или
        заполнить ее на стойке администратора в теннисном клубе "Хоккайдо"
        (Коммунистический проспект 18). Также обязательно наличие медицинской
        справки и свидетельства о страховании от несчастных случаев.
      </p>
      <p class="info">
        Жеребьевка среди детей состоится 13 августа в 17:30 на кортах городского
        парка, среди взрослых 27 августа в 17:30 на кортах городского парка.
      </p>
      <h4 class="info">
        Дополнительная информация по телефону по телефону: 8 (4242) 607-999.
      </h4>
    </el-dialog>
  </div>
</template>

<script>
export default {
  layout: (ctx) => (ctx.isMobile ? 'mobile' : 'default'),
  head: {
    title: `${process.env.appName}`,
    description: `кубок мэра Южно-Сахалинска по теннису`,
  },
  data() {
    return {
      moreInfo: false,
    }
  },
}
</script>

<style lang="scss" scoped>
.info {
  word-break: break-word;
  text-align: left;
  padding-bottom: 10px;
  line-height: 1.4;
  letter-spacing: normal;
}
h4 {
  text-align: left;
  word-break: break-word;
}
.introLink {
  color: #333 !important;
  &::after {
    border-color: #333 !important;
  }
}
.el-drawer__body {
  padding: 30px;
}
video {
  margin-bottom: 10px;
  width: 100%;
  height: auto;
}
</style>